{"class_name": "Model", "config": {"name": "model_409", "layers": [{"name": "input_1277", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1277"}, "inbound_nodes": []}, {"name": "input_1275", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_1275"}, "inbound_nodes": []}, {"name": "input_1276", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_1276"}, "inbound_nodes": []}, {"name": "input_1278", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1278"}, "inbound_nodes": []}, {"name": "multiply_445", "class_name": "Multiply", "config": {"name": "multiply_445", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_1277", 0, 0, {}], ["input_1275", 0, 0, {}]]]}, {"name": "multiply_446", "class_name": "Multiply", "config": {"name": "multiply_446", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_1277", 0, 0, {}], ["input_1276", 0, 0, {}]]]}, {"name": "multiply_447", "class_name": "Multiply", "config": {"name": "multiply_447", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_1278", 0, 0, {}], ["input_1275", 0, 0, {}]]]}, {"name": "multiply_448", "class_name": "Multiply", "config": {"name": "multiply_448", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_1278", 0, 0, {}], ["input_1276", 0, 0, {}]]]}, {"name": "dense_1651", "class_name": "Dense", "config": {"name": "dense_1651", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_445", 0, 0, {}]]]}, {"name": "dense_1652", "class_name": "Dense", "config": {"name": "dense_1652", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_446", 0, 0, {}]]]}, {"name": "dense_1653", "class_name": "Dense", "config": {"name": "dense_1653", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_447", 0, 0, {}]]]}, {"name": "dense_1654", "class_name": "Dense", "config": {"name": "dense_1654", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_448", 0, 0, {}]]]}, {"name": "concatenate_821", "class_name": "Concatenate", "config": {"name": "concatenate_821", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_1651", 0, 0, {}], ["dense_1652", 0, 0, {}], ["dense_1653", 0, 0, {}], ["dense_1654", 0, 0, {}]]]}, {"name": "dropout_392", "class_name": "Dropout", "config": {"name": "dropout_392", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_821", 0, 0, {}]]]}, {"name": "dense_1655", "class_name": "Dense", "config": {"name": "dense_1655", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_392", 0, 0, {}]]]}, {"name": "dense_1656", "class_name": "Dense", "config": {"name": "dense_1656", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1655", 0, 0, {}]]]}], "input_layers": [["input_1275", 0, 0], ["input_1276", 0, 0], ["input_1277", 0, 0], ["input_1278", 0, 0]], "output_layers": [["dense_1656", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}