{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "input_21", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_21"}, "inbound_nodes": []}, {"name": "input_22", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": []}, {"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "multiply_5", "class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_23", 0, 0, {}], ["input_21", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_23", 0, 0, {}], ["input_22", 0, 0, {}]]]}, {"name": "multiply_7", "class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_24", 0, 0, {}], ["input_21", 0, 0, {}]]]}, {"name": "multiply_8", "class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_24", 0, 0, {}], ["input_22", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_17", 0, 0, {}], ["dense_18", 0, 0, {}], ["dense_19", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "dense_21", "class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "dense_22", "class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_21", 0, 0, {}]]]}], "input_layers": [["input_21", 0, 0], ["input_22", 0, 0], ["input_23", 0, 0], ["input_24", 0, 0]], "output_layers": [["dense_22", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}