{"class_name": "Model", "config": {"name": "model_87", "layers": [{"name": "input_137", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "int32", "sparse": false, "name": "input_137"}, "inbound_nodes": []}, {"name": "input_138", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "int32", "sparse": false, "name": "input_138"}, "inbound_nodes": []}, {"name": "embedding_53", "class_name": "Embedding", "config": {"name": "embedding_53", "trainable": true, "batch_input_shape": [null, 300], "dtype": "float32", "input_dim": 20000, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 300}, "inbound_nodes": [[["input_137", 0, 0, {}]]]}, {"name": "embedding_54", "class_name": "Embedding", "config": {"name": "embedding_54", "trainable": true, "batch_input_shape": [null, 300], "dtype": "float32", "input_dim": 20000, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 300}, "inbound_nodes": [[["input_138", 0, 0, {}]]]}, {"name": "conv1d_53", "class_name": "Conv1D", "config": {"name": "conv1d_53", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_53", 0, 0, {}]]]}, {"name": "conv1d_54", "class_name": "Conv1D", "config": {"name": "conv1d_54", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_54", 0, 0, {}]]]}, {"name": "max_pooling1d_53", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_53", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]]}, {"name": "max_pooling1d_54", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_54", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_54", 0, 0, {}]]]}, {"name": "concatenate_60", "class_name": "Concatenate", "config": {"name": "concatenate_60", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["max_pooling1d_53", 0, 0, {}], ["max_pooling1d_54", 0, 0, {}]]]}, {"name": "flatten_27", "class_name": "Flatten", "config": {"name": "flatten_27", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_60", 0, 0, {}]]]}, {"name": "dropout_48", "class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_27", 0, 0, {}]]]}, {"name": "dense_179", "class_name": "Dense", "config": {"name": "dense_179", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"name": "dense_180", "class_name": "Dense", "config": {"name": "dense_180", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_179", 0, 0, {}]]]}], "input_layers": [["input_137", 0, 0], ["input_138", 0, 0]], "output_layers": [["dense_180", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}