{"class_name": "Model", "config": {"name": "model_65", "layers": [{"name": "input_189", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_189"}, "inbound_nodes": []}, {"name": "input_191", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_191"}, "inbound_nodes": []}, {"name": "input_190", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_190"}, "inbound_nodes": []}, {"name": "input_192", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_192"}, "inbound_nodes": []}, {"name": "concatenate_112", "class_name": "Concatenate", "config": {"name": "concatenate_112", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["input_189", 0, 0, {}], ["input_191", 0, 0, {}]]]}, {"name": "concatenate_113", "class_name": "Concatenate", "config": {"name": "concatenate_113", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["input_190", 0, 0, {}], ["input_191", 0, 0, {}]]]}, {"name": "concatenate_114", "class_name": "Concatenate", "config": {"name": "concatenate_114", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["input_189", 0, 0, {}], ["input_192", 0, 0, {}]]]}, {"name": "concatenate_115", "class_name": "Concatenate", "config": {"name": "concatenate_115", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["input_190", 0, 0, {}], ["input_192", 0, 0, {}]]]}, {"name": "dense_253", "class_name": "Dense", "config": {"name": "dense_253", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_112", 0, 0, {}]]]}, {"name": "dense_254", "class_name": "Dense", "config": {"name": "dense_254", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_113", 0, 0, {}]]]}, {"name": "dense_255", "class_name": "Dense", "config": {"name": "dense_255", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_114", 0, 0, {}]]]}, {"name": "dense_256", "class_name": "Dense", "config": {"name": "dense_256", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_115", 0, 0, {}]]]}, {"name": "concatenate_116", "class_name": "Concatenate", "config": {"name": "concatenate_116", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_253", 0, 0, {}], ["dense_254", 0, 0, {}], ["dense_255", 0, 0, {}], ["dense_256", 0, 0, {}]]]}, {"name": "dropout_57", "class_name": "Dropout", "config": {"name": "dropout_57", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_116", 0, 0, {}]]]}, {"name": "dense_257", "class_name": "Dense", "config": {"name": "dense_257", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_57", 0, 0, {}]]]}, {"name": "dense_258", "class_name": "Dense", "config": {"name": "dense_258", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_257", 0, 0, {}]]]}], "input_layers": [["input_189", 0, 0], ["input_190", 0, 0], ["input_191", 0, 0], ["input_192", 0, 0]], "output_layers": [["dense_258", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}