{"class_name": "Model", "config": {"name": "model_140", "layers": [{"name": "input_401", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_401"}, "inbound_nodes": []}, {"name": "input_402", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_402"}, "inbound_nodes": []}, {"name": "dense_573", "class_name": "Dense", "config": {"name": "dense_573", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_401", 0, 0, {}]]]}, {"name": "dense_574", "class_name": "Dense", "config": {"name": "dense_574", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_402", 0, 0, {}]]]}, {"name": "concatenate_258", "class_name": "Concatenate", "config": {"name": "concatenate_258", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_573", 0, 0, {}], ["dense_574", 0, 0, {}]]]}, {"name": "dropout_125", "class_name": "Dropout", "config": {"name": "dropout_125", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_258", 0, 0, {}]]]}, {"name": "dense_575", "class_name": "Dense", "config": {"name": "dense_575", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_125", 0, 0, {}]]]}, {"name": "dense_576", "class_name": "Dense", "config": {"name": "dense_576", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_575", 0, 0, {}]]]}], "input_layers": [["input_401", 0, 0], ["input_402", 0, 0]], "output_layers": [["dense_576", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}