{"class_name": "Model", "config": {"name": "model_113", "layers": [{"name": "input_329", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_329"}, "inbound_nodes": []}, {"name": "input_330", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_330"}, "inbound_nodes": []}, {"name": "dense_465", "class_name": "Dense", "config": {"name": "dense_465", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_329", 0, 0, {}]]]}, {"name": "dense_466", "class_name": "Dense", "config": {"name": "dense_466", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_330", 0, 0, {}]]]}, {"name": "concatenate_213", "class_name": "Concatenate", "config": {"name": "concatenate_213", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_465", 0, 0, {}], ["dense_466", 0, 0, {}]]]}, {"name": "dropout_101", "class_name": "Dropout", "config": {"name": "dropout_101", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_213", 0, 0, {}]]]}, {"name": "dense_467", "class_name": "Dense", "config": {"name": "dense_467", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_101", 0, 0, {}]]]}, {"name": "dense_468", "class_name": "Dense", "config": {"name": "dense_468", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_467", 0, 0, {}]]]}], "input_layers": [["input_329", 0, 0], ["input_330", 0, 0]], "output_layers": [["dense_468", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}